fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение диаграммы Ганта
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	ДанныеДляГанта = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ЭлементыМеток = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементыМеток.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ЭлементыМеток.Кратность = 1;
	ЭлементыМеток.Формат = "ДФ=MMMM.yyyy";
	
	Для Каждого Запись Из ДанныеДляГанта Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Запись.Сотрудник);
		Точка.Текст = Запись.Сотрудник;
		Серия = ДиаграммаГанта.УстановитьСерию(Запись.Год);
//		Серия.Текст = Год(Запись.Год);
		Серия.Текст = Запись.Год;		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала;
		Интервал.Конец = Запись.ДатаОкончания;
		
	КонецЦикла; 
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
